[

    {
    "name": "Up",
    "year": 2009,
    "duration": "1h 36m",
    "genre": "Animation, Adventure, Comedy",
    "description": "78-year-old Carl Fredricksen travels to Paradise Falls in his house equipped with balloons, inadvertently taking a young stowaway"
    },
  {
    "name": "Inside Out",
    "year": 2015,
    "duration": "1h 35m",
    "genre": "Animation, Adventure, Comedy",
    "description": "After young Riley is uprooted from her Midwest life and moved to San Francisco, her emotions - Joy, Fear, Anger, Disgust and Sadness - conflict on how best to navigate a new city, house, and school"  },
  {
    "name": "Coco",
    "year": 2017,
    "duration": "1h 45m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Aspiring musician Miguel, confronted with his family s ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a legendary singer"
  },
  {
    "name": "Soul",
    "year": 2020,
    "duration": "1h 40m",
    "genre": "Animation, Adventure, Comedy",
    "description": "After landing the gig of a lifetime, a New York jazz pianist suddenly finds himself trapped in a strange land between Earth and the afterlife"
  },
  {
    "name": "Luca",
    "year": 2021,
    "duration": "1h 35m",
    "genre": "Animation, Adventure, Comedy",
    "description": "On the Italian Riviera, an unlikely but strong friendship grows between a human being and a sea monster disguised as a human"
  },
  {
    "name": "The Lion King",
    "year": 1994,
    "duration": "1h 28m",
    "genre": "Animation, Adventure, Drama",
    "description": "Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself"
  },
  {
    "name": "The Little Mermaid",
    "year": 1989,
    "duration": "1h 23m",
    "genre": "Animation, Family, Fantasy",
    "description": "A mermaid princess makes a Faustian bargain in an attempt to become human and win a prince`s love"
  },
  {
    "name": "Beauty and the Beast",
    "year": 1991,
    "duration": "1h 24m",
    "genre": "Animation, Family, Fantasy",
    "description": "A prince cursed to spend his days as a hideous monster sets out to regain his humanity by earning a young woman`s love"
  },
  {
    "name": "Aladdin",
    "year": 1992,
    "duration": "1h 30m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When a street urchin vies for the love of a beautiful princess, he uses a genie`s magic power to make himself off as a prince in order to marry her"
  },
  {
    "name": "Pocahontas",
    "year": 1995,
    "duration": "1h 21m",
    "genre": "Animation, Adventure, Drama",
    "description": "An English soldier and the daughter of an Algonquin chief share a romance when English colonists invade 17th century Virginia"
  },
  {
    "name": "Mulan",
    "year": 1998,
    "duration": "1h 28m",
    "genre": "Animation, Adventure, Family",
    "description": "To save her father from death in the army, a young maiden secretly goes in his place and becomes one of China`s greatest heroines in the process"
  },
  {
    "name": "The Princess and the Frog",
    "year": 2009,
    "duration": "1h 37m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A waitress, desperate to fulfill her dreams as a restaurant owner, is set on a journey to turn a frog prince back into a human being, but she has to face the same problem after she kisses him"
  },
  {
    "name": "Tangled",
    "year": 2010,
    "duration": "1h 40m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The magically long-haired Rapunzel has spent her entire life in a tower, but now that a runaway thief has stumbled upon her, she is about to discover the world for the first time, and who she really is"
  },
  {
    "name": "Frozen",
    "year": 2013,
    "duration": "1h 42m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When the newly crowned Queen Elsa accidentally uses her power to turn things into ice to curse her home in infinite winter, her sister Anna teams up with a mountain "
  },
  {
    "name": "Moana",
    "year": 2016,
    "duration": "1h 47m",
    "genre": "Animation, Adventure, Comedy",
    "description": "In Ancient Polynesia, when a terrible curse incurred by the Demigod Maui reaches Moana`s island, she answers the Ocean`s call to seek out the Demigod to set things right"
  },
  {
    "name": "Cinderella 2",
    "year": 1950,
    "duration": "1h 14m",
    "genre": "Animation, Family, Fantasy",
    "description": "When Cinderella`s cruel stepmother prevents her from attending the Royal Ball, she gets some unexpected help from the lovable mice Gus and Jaq, and from"
  },
  {
    "name": "Brave",
    "year": 2012,
    "duration": "1h 33m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Determined to make her own path in life, Princess Merida defies a custom that brings chaos to her kingdom. Granted one wish, Merida must rely on her bravery and her archery skills to undo a beastly curse"
  },
  {
    "name": "Cinderella",
    "year": 1950,
    "duration": "1h 14m",
    "genre": "Animation, Family, Fantasy",
    "description": "When Cinderella`s cruel stepmother prevents her from attending the Royal Ball, she gets some unexpected help from the lovable mice Gus and Jaq, and from"
  },
  {
    "name": "Sleeping Beauty",
    "year": 1959,
    "duration": "1h 15m",
    "genre": "Animation, Family, Fantasy",
    "description": "After being snubbed by the royal family, a malevolent fairy places a curse on a princess which only a prince can break, along with the help of three good fairies"
  },
  {
    "name": "The Jungle Book",
    "year": 1967,
    "duration": "1h 18m",
    "genre": "Animation, Adventure, Family",
    "description": "Bagheera the Panther and Baloo the Bear have a difficult time trying to convince "
  },
  {
    "name": "101 Dalmatians",
    "year": 1961,
    "duration": "1h 19m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When a litter of Dalmatian puppies are abducted by the minions of Cruella de Vil, the parents must find them before she uses them for a diabolical fashion statement"
  },
  {
    "name": "Bambi",
    "year": 1942,
    "duration": "1h 10m",
    "genre": "Animation, Drama, Family",
    "description": "The story of a young deer growing up in the forest"
  },
  {
    "name": "Dumbo",
    "year": 1941,
    "duration": "1h 4m",
    "genre": "Animation, Drama, Family",
    "description": "Ridiculed because of his enormous ears, a young circus elephant is assisted by a mouse to achieve his full potential"
  },
  {
    "name": "Peter Pan",
    "year": 1953,
    "duration": "1h 17m",
    "genre": "Animation, Adventure, Family",
    "description": "The Darling family children receive a visit from Peter Pan, who takes them to Never Never Land where an ongoing war with the evil Pirate Captain Hook is taking place"
  },
  {
    "name": "Lady and the Tramp",
    "year": 1955,
    "duration": "1h 16m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The romantic tale of a sheltered uptown Cocker Spaniel dog and a streetwise downtown Mutt"
  },
  {
    "name": "The Aristocats",
    "year": 1970,
    "duration": "1h 18m",
    "genre": "Animation, Adventure, Comedy",
    "description": "With the help of a smooth talking tomcat, a family of Parisian felines set to inherit a fortune from their owner try to make it back home after a jealous butler kidnaps them and leaves them in the country"
  },
  {
    "name": "Robin Hood",
    "year": 1973,
    "duration": "1h 23m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The story of the legendary outlaw is portrayed with the characters as humanoid animals"
  },
  {
    "name": "The Rescuers",
    "year": 1977,
    "duration": "1h 18m",
    "genre": "Animation, Adventure, Crime",
    "description": "Two mice of the Rescue Aid Society search for a little girl kidnapped by unscrupulous treasure hunters"
  },
  {
    "name": "The Fox and the Hound",
    "year": 1981,
    "duration": "1h 23m",
    "genre": "Animation, Adventure, Drama",
    "description": "Two childhood friends find themselves forced to become enemies"
  },
  {
    "name": "The Great Mouse Detective",
    "year": 1986,
    "duration": "1h 14m",
    "genre": "Animation, Adventure, Family",
    "description": "Basil, the rodent Sherlock Holmes, investigates the kidnapping of a toy-maker and uncovers its link to his arch-enemy, Professor Ratigan"
  },
  {
    "name": "Oliver & Company",
    "year": 1988,
    "duration": "1h 14m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A lost and alone kitten joins a gang of dogs engaged in petty larceny in New York City"
  },
  {
    "name": "The Sword in the Stone",
    "year": 1963,
    "duration": "1h 19m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A poor boy named Arthur learns the power of love, kindness, knowledge and bravery with the help of a wizard called Merlin in the path to become one of the most beloved kings in English history"
  },
  {
    "name": "The Black Cauldron",
    "year": 1985,
    "duration": "1h 20m",
    "genre": "Animation, Action, Adventure",
    "description": "A young boy and a bunch of misfit friends embark on a quest to find a dark magic item of ultimate power before a diabolical tyrant can"
  },
  {
    "name": "The Hunchback of Notre Dame",
    "year": 1996,
    "duration": "1h 31m",
    "genre": "Animation, Drama, Family",
    "description": "A deformed bell-ringer must assert his independence from a vicious government minister in order to help his friend, a gypsy dancer"
  },
  {
    "name": "Hercules",
    "year": 1997,
    "duration": "1h 33m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The son of Zeus and Hera is stripped of his immortality as an infant and must become a true hero in order to reclaim it"
  },
  {
    "name": "Tarzan",
    "year": 1999,
    "duration": "1h 28m",
    "genre": "Animation, Adventure, Family",
    "description": "A man raised by gorillas must decide where he really belongs when he discovers he is a human"
  },
  {
    "name": "Toy Story",
    "year": 1995,
    "duration": "1h 21m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy s room."
  },
  {
    "name": "Toy Story 2",
    "year": 1999,
    "duration": "1h 32m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When Woody is stolen by a toy collector, Buzz and his friends set out on a rescue mission to save Woody before he becomes a museum toy property with his roundup gang Jessie, Prospector, and Bullseye."
  },
  {
    "name": "Toy Story 3",
    "year": 2010,
    "duration": "1h 43m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The toys are mistakenly delivered to a daycare center instead of the attic right before Andy leaves for college, and it s up to Woody to convince the other toys that they weren t abandoned and to return home."
  },
  {
    "name": "Finding Nemo",
    "year": 2003,
    "duration": "1h 40m",
    "genre": "Animation, Adventure, Comedy",
    "description": "After his son is captured in the Great Barrier Reef and taken to Sydney, a timid clownfish sets out on a journey to bring him home."
  },
  {
    "name": "Finding Dory",
    "year": 2016,
    "duration": "1h 37m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Friendly but forgetful blue tang Dory begins a search for her long-lost parents, and everyone learns a few things about the real meaning of family along the way."
  },
  {
    "name": "Monsters, Inc.",
    "year": 2001,
    "duration": "1h 32m",
    "genre": "Animation, Adventure, Comedy",
    "description": "In order to power the city, monsters have to scare children so that they scream. However, the children are toxic to the monsters, and after a child gets through, two monsters realize things may not be what they think."
  },
  {
    "name": "Monsters University",
    "year": 2013,
    "duration": "1h 44m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A look at the relationship between Mike Wazowski (Billy Crystal) and James P. \"Sully\" Sullivan (John Goodman) during their days at Monsters University, when they weren t necessarily the best of friends."
  },
  {
    "name": "Shrek",
    "year": 2001,
    "duration": "1h 30m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A mean lord exiles fairytale creatures to the swamp of a grumpy ogre, who must go on a quest and rescue a princess for the lord in order to get his land back."
  },
  {
    "name": "Shrek 2",
    "year": 2004,
    "duration": "1h 33m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Shrek and Fiona travel to the Kingdom of Far Far Away, where Fiona s parents are King and Queen, to celebrate their marriage. When they arrive, they find they are not as welcome as they thought they would be."
  },
  {
    "name": "Shrek the Third",
    "year": 2007,
    "duration": "1h 33m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When his new father-in-law, King Harold falls ill, Shrek is looked at as the heir to the land of Far, Far Away. Not one to give up his beloved swamp, Shrek recruits his friends Donkey and Puss in Boots to install the rebellious Artie as the new king."
  },
  {
    "name": "Shrek Forever After",
    "year": 2010,
    "duration": "1h 33m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Rumpelstiltskin tricks a mid-life crisis burdened Shrek into allowing himself to be erased from existence and cast in a dark alternate timeline where Rumpel rules supreme."
  },
  {
    "name": "Ice Age",
    "year": 2002,
    "duration": "1h 21m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Set during the Ice Age, a sabertooth tiger, a sloth, and a wooly mammoth find a lost human infant, and they try to return him to his tribe."
  },
  {
    "name": "Ice Age: The Meltdown",
    "year": 2006,
    "duration": "1h 31m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Manny, Sid, and Diego discover that the Ice Age is coming to an end, and join everybody for a journey to higher ground. On the trip, they discover that Manny, in fact, is not the last of the woolly mammoths."
  },
  {
    "name": "Ice Age: Dawn of the Dinosaurs",
    "year": 2009,
    "duration": "1h 34m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When Sid s attempt to adopt three dinosaur eggs gets him abducted by their real mother to an underground lost world, his friends attempt to rescue him."
  },
  {
    "name": "Ice Age: Continental Drift",
    "year": 2012,
    "duration": "1h 28m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Manny, Diego, and Sid embark upon another adventure after their continent is set adrift. Using an iceberg as a ship, they encounter sea creatures and battle pirates as they explore a new world."
  },
  {
    "name": "The Lego Movie",
    "year": 2014,
    "duration": "1h 40m",
    "genre": "Animation, Action, Adventure",
    "description": "An ordinary LEGO construction worker, thought to be the prophesied as \"special\", is recruited to join a quest to stop an evil tyrant from gluing the LEGO universe into eternal stasis."
  },
  {
    "name": "The Lego Batman Movie",
    "year": 2017,
    "duration": "1h 44m",
    "genre": "Animation, Action, Comedy",
    "description": "A cooler-than-ever Bruce Wayne must deal with the usual suspects as they plan to rule Gotham City, while discovering that he has accidentally adopted a teenage orphan who wishes to become his sidekick."
  },
  {
    "name": "The Lego Movie 2: The Second Part",
    "year": 2019,
    "duration": "1h 47m",
    "genre": "Animation, Action, Adventure",
    "description": "It s been five years since everything was awesome and the citizens are facing a huge new threat: LEGO DUPLO® invaders from outer space, wrecking everything faster than they can rebuild."
  },
  {
    "name": "Luca",
    "year": 2021,
    "duration": "1h 35m",
    "genre": "Animation, Adventure, Comedy",
    "description": "On the Italian Riviera, an unlikely but strong friendship grows between a human being and a sea monster disguised as a human."
  },
  {
    "name": "Soul",
    "year": 2020,
    "duration": "1h 40m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A musician who has lost his passion for music is transported out of his body and must find his way back with the help of an infant soul learning about herself."
  },
  {
    "name": "Encanto",
    "year": 2021,
    "duration": "1h 42m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A young Colombian girl has to face the frustration of being the only member of her family without magical powers."
  },
  {
    "name": "Raya and the Last Dragon",
    "year": 2021,
    "duration": "1h 47m",
    "genre": "Animation, Action, Adventure",
    "description": "In a realm known as Kumandra, a re-imagined Earth inhabited by an ancient civilization, a warrior named Raya is determined to find the last dragon."
  },
  {
    "name": "Vivo",
    "year": 2021,
    "duration": "1h 35m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The film centers around a kinkajou who embarks on a journey to deliver a love song from Havana to Miami in order to fulfill his owner s last wish."
  },
  {
    "name": "Ron s Gone Wrong",
    "year": 2021,
    "duration": "1h 47m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A robot named Ron, who is programmed to be the best friend of its owner, a young boy named Barney, goes wrong."
  },
  {
    "name": "Wish Dragon",
    "year": 2021,
    "duration": "1h 39m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Determined teen Din is longing to reconnect with his childhood best friend when he meets a wish-granting dragon who shows him the magic of possibilities."
  },
  {
    "name": "Spirit Untamed",
    "year": 2021,
    "duration": "1h 27m",
    "genre": "Animation, Adventure, Family",
    "description": "Lucky Prescott s life is changed forever when she moves from her home in the city to a small frontier town and befriends a wild mustang named Spirit."
  },
  {
    "name": "Tom and Jerry",
    "year": 2021,
    "duration": "1h 41m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A chaotic battle ensues between Jerry Mouse, who has taken refuge in the Royal Gate Hotel, and Tom Cat, who is hired to drive him away before the day of a big wedding arrives."
  },
  {
    "name": "Space Jam: A New Legacy",
    "year": 2021,
    "duration": "1h 55m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Basketball superstar LeBron James teams up with Bugs Bunny and the rest of the Looney Tunes for this long-awaited sequel."
  },
  {
    "name": "The Boss Baby: Family Business",
    "year": 2021,
    "duration": "1h 47m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The Templeton brothers have become adults and drifted away from each other, but a new boss baby with a cutting-edge approach is about to bring them together again - and inspire a new family business."
  },
  {
    "name": "Paw Patrol: The Movie",
    "year": 2021,
    "duration": "1h 26m",
    "genre": "Animation, Action, Adventure",
    "description": "The PAW Patrol is on a roll! When their biggest rival, Humdinger, becomes Mayor of nearby Adventure City and starts wreaking havoc, Ryder and everyone s favorite heroic pups kick into high gear to face the challenge head on."
  },
  {
    "name": "My Little Pony: A New Generation",
    "year": 2021,
    "duration": "1h 31m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Equestria s divided. But a bright-eyed hero believes Earth Ponies, Pegasi and Unicorns should be pals - and, hoof to heart, she s determined to prove it."
  },
  {
    "name": "Extinct",
    "year": 2021,
    "duration": "1h 24m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Op and Ed, two adorable donut-shaped animals - flummels - accidentally time-travel from 1835"
  },
  {
    "name": "The Croods: A New Age",
    "year": 2020,
    "duration": "1h 35m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The prehistoric family the Croods are challenged by a rival family the Bettermans, who claim to be better and more evolved."
  },
  {
    "name": "Over the Moon",
    "year": 2020,
    "duration": "1h 35m",
    "genre": "Animation, Adventure, Family",
    "description": "In this animated musical, a girl builds a rocket ship and blasts off, hoping to meet a mythical moon goddess."
  },
  {
    "name": "Arlo the Alligator Boy",
    "year": 2021,
    "duration": "1h 30m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A young humanoid alligator travels to the big city in hopes of reuniting with his estranged father."
  },
  {
    "name": "Maya the Bee: The Golden Orb",
    "year": 2021,
    "duration": "1h 28m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When Maya, a headstrong little bee, and her best friend Willi, rescue an ant princess they find themselves in the middle of an epic bug battle that will take them to strange new worlds and test their friendship to its limits."
  },
  {
    "name": "Secret Magic Control Agency",
    "year": 2021,
    "duration": "1h 45m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Hansel and Gretel of the titular agency must infiltrate the witches  coven to save the world from the witches  spell."
  },
  {
    "name": "Ainbo: Spirit of the Amazon",
    "year": 2021,
    "duration": "1h 30m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A girl was born"
  },
  {
    "name": "The SpongeBob Movie: Sponge on the Run",
    "year": 2020,
    "duration": "1h 31m",
    "genre": "Animation, Adventure, Comedy",
    "description": "SpongeBob and Patrick travel to the lost city of Atlantic City to solve the mysterious kidnapping of Gary the snail. They soon prove that there s nothing stronger than the power of friendship as they encounter danger and delight at every turn."
  },
  {
    "name": "Clifford the Big Red Dog",
    "year": 2021,
    "duration": "1h 37m",
    "genre": "Animation, Adventure, Comedy",
    "description": "As Emily struggles to fit in at home and at school, she discovers a small red puppy who is destined to become her best friend. When Clifford magically undergoes one heck of a growth spurt, becomes a gigantic dog, and attracts the attention of a genetics company, Emily and her uncle Casey have to fight the forces of greed as they go on the run across New York City."
  },
  {
    "name": "Farmageddon: A Shaun the Sheep Movie",
    "year": 2019,
    "duration": "1h 26m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When an alien with amazing powers crash-lands near Mossy Bottom Farm, Shaun the Sheep goes on a mission to shepherd the intergalactic visitor home before a sinister organization can capture her."
  },
  {
    "name": "The Addams Family 2",
    "year": 2021,
    "duration": "1h 33m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The Addams get tangled up in more wacky adventures and find themselves involved in hilarious run-ins with all sorts of unsuspecting characters."
  },
  {
    "name": "Robin Robin",
    "year": 2021,
    "duration": "0h 32m",
    "genre": "Animation, Short, Adventure",
    "description": "When her egg fortuitously rolls into a rubbish dump, Robin is raised by a loving family of mice. As she grows up, her differences become more apparent. Robin sets off on the heist to end all heists to prove to her family that she can be a really good mouse - but ends up discovering who she really is."
  },
  {
    "name": "Back to the Outback",
    "year": 2021,
    "duration": "N/A",
    "genre": "Animation, Adventure, Comedy",
    "description": "Tired of being locked in a reptile house where humans gawk at them like they re monsters, a group of Australia s deadliest creatures plot a daring escape from their zoo to the Outback, a place where they ll fit in without being judged."
  },
  {
    "name": "Wishmas Tree",
    "year": 2020,
    "duration": "1h 25m",
    "genre": "Animation, Adventure, Family",
    "description": "A young possum s misguided wish for a white Wishmas not only freezes her entire hometown of Sanctuary City but also threatens the lives of all who live there. Before the magical Wishmas Tree dies, she must undertake a perilous journey into the WILD; battling self-doubt, ghostly predators and ultimately, Extinction itself, to reverse the damage she has caused and save her city."
  },
  {
    "name": "Blush",
    "year": 2019,
    "duration": "1h 14m",
    "genre": "Animation, Family, Adventure",
    "description": "A young girl, savvy in the ways of surviving modern society on the streets, is reunited with her long-lost father for one magical night of dreams, adventure, and healing."
  },
  {
    "name": "Monster Family 2",
    "year": 2021,
    "duration": "1h 39m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The Wishbone family are far from happy. In an attempt to reconnect as a family, Mum and Emma plan a fun night out. However, her plan backfires when an evil witch curses them, and they re all turned into Monsters."
  },
  {
    "name": "Rumble",
    "year": 2021,
    "duration": "1h 44m",
    "genre": "Animation, Adventure, Comedy",
    "description": "In a world where monster wrestling is a global sport and monsters are superstar athletes, teenage Winnie seeks to follow in her father s footsteps by coaching a lovable underdog monster into a champion."
  },
  {
    "name": "Trouble",
    "year": 2019,
    "duration": "1h 27m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A pampered dog named Trouble must learn to live in the real world while trying to escape from his former owner s greedy children and must learn how to survive on the big city streets."
  },
  {
    "name": "Batman: The Long Halloween, Part One",
    "year": 2021,
    "duration": "1h 25m",
    "genre": "Animation, Action, Crime",
    "description": "Inspired by the iconic mid-1990s DC story from Jeph Loeb and Tim Sale, Batman: The Long Halloween, Part One begins as a brutal murder on Halloween prompts Gotham s young vigilante, the Batman, to form a pact with the city s only two uncorrupt lawmen (Police Captain James Gordon and District Attorney Harvey Dent) in order to take down The Roman, head of the notorious and powerful Falcone Crime Family."
  },
  {
    "name": "Batman: The Long Halloween, Part Two",
    "year": 2021,
    "duration": "1h 28m",
    "genre": "Animation, Action, Crime",
    "description": "The killer known as Holiday continues to stalk the Falcone crime family while a new class of costumed criminal rises in Gotham City. Batman suspects that a former ally might be the serial killer."
  },
  {
    "name": "Boonie Bears: The Wild Life",
    "year": 2021,
    "duration": "1h 33m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The Boonie Bears set off on a wild adventure through the mystical land of Fantastica."
  },
  {
    "name": "Dog Gone Trouble",
    "year": 2019,
    "duration": "1h 22m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A pampered dog named Trouble must learn to live in the real world while trying to escape from his former owner s greedy children and must learn how to survive on the big city streets."
  },
  {
    "name": "Fearless",
    "year": 2020,
    "duration": "1h 29m",
    "genre": "Animation, Adventure, Family",
    "description": "A teen gamer is forced to level up to full-time babysitter when his favorite video game drops three superpowered infants from space into his backyard."
  },
  {
    "name": "The Loud House Movie",
    "year": 2021,
    "duration": "1h 57m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The Loud family goes on vacation to Scotland."
  },
  {
    "name": "The War with Grandpa",
    "year": 2020,
    "duration": "1h 34m",
    "genre": "Comedy, Drama, Family",
    "description": "Upset that he has to share the room he loves with his grandfather, Peter decides to declare war in an attempt to get it back."
  },
  {
    "name": "Bigfoot Family",
    "year": 2020,
    "duration": "1h 29m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Bigfoots now a big deal. So when he goes missing, his shy but tech-savvy teen son must take on an evil CEO to save his family and a wildlife preserve."
  },
  {
    "name": "Jungle Beat: The Movie",
    "year": 2020,
    "duration": "1h 28m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A homesick alien crash-lands his spaceship near the colorful African Jungle. His new animal friends need to get him back to his ship and teach him about friendship and fun before his Space-Conqueror father can take over the planet."
  },
  {
    "name": "Charming",
    "year": 2018,
    "duration": "1h 30m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Three fairy tale princesses find themselves engaged to the same guy, Prince Charming."
  },
  {
    "name": "Tall Tales from the Magical Garden of Antoon Krings",
    "year": 2017,
    "duration": "1h 28m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When Apollo, a kind-hearted traveling performer and ingenious cricket, lands in the village of the Funny Little Bugs, the whole kingdom is about to be disrupted. The beloved reigning queen bee Marguerite is soon kidnapped on the orders of her jealous and treacherous cousin Wendy, who sets up a trap to frame Apollo for the crime, causing panic and despair in the hive."
  },
  {
    "name": "The Willoughbys",
    "year": 2020,
    "duration": "1h 30m",
    "genre": "Animation, Comedy, Family",
    "description": "Convinced they d be better off raising themselves, the Willoughby children hatch a sneaky plan to send their selfish parents on vacation. The siblings then embark on their own high-flying adventure to find the true meaning of family."
  },
  {
    "name": "Minions: The Rise of Gru",
    "year": 2022,
    "duration": "1h 51m",
    "genre": "Animation, Action, Adventure",
    "description": "The untold story of one twelve-year-olds dream to become the worlds greatest supervillain."
  },
  {
    "name": "Earwig and the Witch",
    "year": 2020,
    "duration": "1h 22m",
    "genre": "Animation, Family, Fantasy",
    "description": "A headstrong orphan discovers a world of spells and potions while living with a selfish witch."
  },
  {
    "name": "Here We Are: Notes for Living on Planet Earth",
    "year": 2020,
    "duration": "0h 37m",
    "genre": "Animation, Short, Family",
    "description": "A precocious 7-year-old who, over the course of Earth Day, learns about the wonders of the planet from his parents and from a mysterious exhibit at the aptly titled Museum of Everything."
  },
  {
    "name": "Wolfwalkers",
    "year": 2020,
    "duration": "1h 43m",
    "genre": "Animation, Adventure, Family",
    "description": "A young apprentice hunter and her father journey to Ireland to help wipe out the last wolf pack. But everything changes when she befriends a free-spirited girl from a mysterious tribe rumored to transform into wolves by night."
  },
  {
    "name": "Spider-Man: Into the Spider-Verse",
    "year": 2018,
    "duration": "1h 57m",
    "genre": "Animation, Action, Adventure",
    "description": "Teen Miles Morales becomes Spider-Man of his reality, crossing his path with five counterparts from other dimensions to stop a threat for all realities."
  },
  {
    "name": "Frozen II",
    "year": 2019,
    "duration": "1h 43m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Anna, Elsa, Kristoff, Olaf, and Sven leave Arendelle to travel to an ancient, autumn-bound forest of an enchanted land. They set out to find the origin of Elsas powers in order to save their kingdom."
  },
  {
    "name": "Onward",
    "year": 2020,
    "duration": "1h 42m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Two elven brothers embark on a quest to bring their father back for one day."
  },
  {
    "name": "Toy Story 4",
    "year": 2019,
    "duration": "1h 40m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When a new toy called Forky joins Woody and the gang, a road trip alongside old and new friends reveals how big the world can be for a toy."
  },
  {
    "name": "The Lion King",
    "year": 2019,
    "duration": "1h 58m",
    "genre": "Animation, Adventure, Drama",
    "description": "After the murder of his father, a young lion prince flees his kingdom only to learn the true meaning of responsibility and bravery."
  },
  {
    "name": "Frozen",
    "year": 2013,
    "duration": "1h 42m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When the newly crowned Queen Elsa accidentally uses her power to turn things into ice to curse her home in infinite winter, her sister Anna teams up with a mountain man, his playful reindeer, and a snowman to change the weather condition."
  },
  {
    "name": "Moana",
    "year": 2016,
    "duration": "1h 47m",
    "genre": "Animation, Adventure, Comedy",
    "description": "In Ancient Polynesia, when a terrible curse incurred by the Demigod Maui reaches Moanas island, she answers the Oceans call to seek out the Demigod to set things right."
  },
  {
    "name": "Zootopia",
    "year": 2016,
    "duration": "1h 48m",
    "genre": "Animation, Adventure, Comedy",
    "description": "In a city of anthropomorphic animals, a rookie bunny cop and a cynical con artist fox must work together to uncover a conspiracy."
  },
  {
    "name": "Finding Dory",
    "year": 2016,
    "duration": "1h 37m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Friendly but forgetful blue tang Dory begins a search for her long-lost parents, and everyone learns a few things about the real meaning of family along the way."
  },
  {
    "name": "Inside Out",
    "year": 2015,
    "duration": "1h 35m",
    "genre": "Animation, Adventure, Comedy",
    "description": "After young Riley is uprooted from her Midwest life and moved to San Francisco, her emotions - Joy, Fear, Anger, Disgust, and Sadness - conflict on how best to navigate a new city, house, and school."
  },
  {
    "name": "Coco",
    "year": 2017,
    "duration": "1h 45m",
    "genre": "Animation, Adventure, Family",
    "description": "Aspiring musician Miguel, confronted with his familys ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a legendary singer."
  },
  {
    "name": "Trolls World Tour",
    "year": 2020,
    "duration": "1h 30m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When the Queen of the Hard Rock Trolls tries to take over all the Troll kingdoms, Queen Poppy and her friends try different ways to save all the Trolls."
  },
  {
    "name": "The Secret Life of Pets 2",
    "year": 2019,
    "duration": "1h 26m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Continuing the story of Max and his pet friends, following their secret lives after their owners leave them for work or school each day."
  },
  {
    "name": "Ralph Breaks the Internet",
    "year": 2018,
    "duration": "1h 52m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Six years after the events of Wreck-It Ralph, Ralph and Vanellope, now friends, discover a Wi-Fi router in their arcade, leading them into a new adventure."
  },
  {
    "name": "The Incredibles 2",
    "year": 2018,
    "duration": "1h 58m",
    "genre": "Animation, Action, Adventure",
    "description": "The Incredibles family takes on a new mission which involves a change in family roles: Bob Parr (Mr. Incredible) must manage the house while his wife Helen (Elastigirl) goes out to save the world."
  },
  {
    "name": "The Angry Birds Movie 2",
    "year": 2019,
    "duration": "1h 37m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The flightless birds and scheming green pigs take their feud to the next level."
  },
  {
    "name": "Despicable Me 3",
    "year": 2017,
    "duration": "1h 29m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Gru meets his long-lost, charming, cheerful, and more successful twin brother Dru, who wants to team up with him for one last criminal heist."
  },
  {
    "name": "Kung Fu Panda 3",
    "year": 2016,
    "duration": "1h 35m",
    "genre": "Animation, Action, Adventure",
    "description": "Continuing his legendary adventures of awesomeness, Po must face two hugely epic but different threats: one supernatural and the other a little closer to home."
  },
  {
    "name": "The Boss Baby",
    "year": 2017,
    "duration": "1h 37m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A suit-wearing, briefcase-carrying baby pairs up with his 7-year-old brother to stop the dastardly plot of the CEO of Puppy Co."
  },
  {
    "name": "Cars 3",
    "year": 2017,
    "duration": "1h 42m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Lightning McQueen sets out to prove to a new generation of racers that hes still the best race car in the world."
  },
  {
    "name": "Hotel Transylvania 3: Summer Vacation",
    "year": 2018,
    "duration": "1h 37m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Count Dracula and company participate in a cruise for sea-loving monsters, unaware that their boat is being commandeered by the monster-hating Van Helsing family."
  },
  {
    "name": "The LEGO Movie 2: The Second Part",
    "year": 2019,
    "duration": "1h 47m",
    "genre": "Animation, Action, Adventure",
    "description": "Its been five years since everything was awesome and the citizens are facing a huge new threat: LEGO Duplo invaders from outer space, wrecking everything faster than they can rebuild."
  },
  {
    "name": "How to Train Your Dragon: The Hidden World",
    "year": 2019,
    "duration": "1h 44m",
    "genre": "Animation, Action, Adventure",
    "description": "When Hiccup discovers Toothless isnt the only Night Fury, he must seek The Hidden World, a secret Dragon Utopia before a hired tyrant named Grimmel finds it first."
  },
  {
    "name": "Spider-Man: Into the Spider-Verse",
    "year": 2018,
    "duration": "1h 57m",
    "genre": "Animation, Action, Adventure",
    "description": "Teen Miles Morales becomes Spider-Man of his reality, crossing his path with five counterparts from other dimensions to stop a threat for all realities."
  },
  {
    "name": "The Grinch",
    "year": 2018,
    "duration": "1h 25m",
    "genre": "Animation, Comedy, Family",
    "description": "A grumpy Grinch plots to ruin Christmas for the village of Whoville."
  },
  {
    "name": "Paddington 2",
    "year": 2017,
    "duration": "1h 43m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Paddington, now happily settled with the Brown family and a popular member of the local community, picks up a series of odd jobs to buy the perfect present for his Aunt Lucys 100th birthday, only for the gift to be stolen."
  },
  {
    "name": "Abominable",
    "year": 2019,
    "duration": "1h 37m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Three teenagers must help a Yeti return to his family while avoiding a wealthy man and a zoologist who want him for their own needs."
  },
  {
    "name": "The Addams Family",
    "year": 2019,
    "duration": "1h 27m",
    "genre": "Animation, Comedy, Family",
    "description": "The eccentrically macabre family."
  },
  {
    "name": "Klaus",
    "year": 2019,
    "duration": "1h 36m",
    "genre": "Animation, Adventure, Comedy",
    "description": "A simple act of kindness always sparks another, even in a frozen, faraway place. When Smeerensburgs new postman, Jesper, befriends toymaker Klaus, their gifts melt an age-old feud and deliver a sleigh full of holiday traditions."
  },
  {
    "name": "The Willoughbys",
    "year": 2020,
    "duration": "1h 30m",
    "genre": "Animation, Comedy, Family",
    "description": "Convinced theyd be better off raising themselves, the Willoughby children hatch a sneaky plan to send their selfish parents on vacation. The siblings then embark on their own high-flying adventure to find the true meaning of family."
  },
  {
    "name": "Shaun the Sheep Movie: Farmageddon",
    "year": 2019,
    "duration": "1h 26m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When an alien with amazing powers crash-lands near Mossy Bottom Farm, Shaun the Sheep goes on a mission to shepherd the intergalactic visitor home before a sinister organization can capture her."
  },
  {
    "name": "Pets United",
    "year": 2019,
    "duration": "1h 32m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When Roger, a Robin Hood-esque stray dog, teams up with Belle, a smooth-talking cat, they set off on an adventure to stop an eccentric billionaires plan to turn a community into a lavish Las Vegas-style amusement park."
  },
  {
    "name": "Onward",
    "year": 2020,
    "duration": "1h 42m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Two elven brothers embark on a quest to bring their father back for one day."
  },
  {
    "name": "Over the Moon",
    "year": 2020,
    "duration": "1h 40m",
    "genre": "Animation, Adventure, Family",
    "description": "A bright young girl builds a rocket ship to the moon to prove the existence of a legendary Moon Goddess. There she ends up on an unexpected quest, and discovers a whimsical land of fantastical creatures."
  },
  {
    "name": "Wolfwalkers",
    "year": 2020,
    "duration": "1h 43m",
    "genre": "Animation, Adventure, Family",
    "description": "A young apprentice hunter and her father journey to Ireland to help wipe out the last wolf pack. But everything changes when she befriends a free-spirited girl from a mysterious tribe rumored to transform into wolves by night."
  },
  {
    "name": "Latte and the Magic Waterstone",
    "year": 2019,
    "duration": "1h 22m",
    "genre": "Animation, Adventure, Comedy",
    "description": "In a magical faraway land, in a picturesque little village nestled among green meadows and rolling hills, lives a flock of carefree sheep. But their pastoral and stress-free life is interrupted when a pack of wolves sets up camp in the nearby ravine."
  },
  {
    "name": "Calamity, a Childhood of Martha Jane Cannary",
    "year": 2020,
    "duration": "1h 25m",
    "genre": "Animation, Adventure, Family",
    "description": "A journey into the childhood of the most iconic wild west figure: Calamity Jane. The film explores the relationship between young Martha Jane and the young boy who would become the legendary outlaw, Calamity Jane."
  },
  {
    "name": "Mortal Kombat Legends: Scorpions Revenge",
    "year": 2020,
    "duration": "1h 20m",
    "genre": "Animation, Action, Adventure",
    "description": "Hanzo Hasashi loses his clan, family, and his life during an attack by a rival ninja clan. He is resurrected as Scorpion, a hell-spawned specter bent on revenge, in this action-packed animated feature."
  },
  {
    "name": "Bigfoot Family",
    "year": 2020,
    "duration": "1h 32m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Bigfoots now a big deal. So when he goes missing, his shy but tech-savvy teen son must take on an evil CEO to save his family and a wildlife preserve."
  },
  {
    "name": "Scoob!",
    "year": 2020,
    "duration": "1h 33m",
    "genre": "Animation, Adventure, Comedy",
    "description": "Scooby and the gang face their most challenging mystery ever: a plot to unleash the ghost dog Cerberus upon the world. As they race to stop this dogpocalypse, the gang discovers that Scooby has an epic destiny greater than anyone imagined."
  },
  {
    "name": "Trolls World Tour",
    "year": 2020,
    "duration": "1h 31m",
    "genre": "Animation, Adventure, Comedy",
    "description": "When the Queen of the Hard Rock Trolls tries to take over all the Troll kingdoms, Queen Poppy and her friends try different ways to save all the Trolls."
  },
  {
    "name": "Sonic the Hedgehog",
    "year": 2020,
    "duration": "1h 39m",
    "genre": "Action, Adventure, Comedy",
    "description": "After discovering a small, blue, fast hedgehog, a small-town police officer must help him defeat an evil genius who wants to do experiments on him."
  },
  {
    "name": "Superman: Red Son",
    "year": 2020,
    "duration": "1h 24m",
    "genre": "Animation, Action, Sci-Fi",
    "description": "What if baby Kal-Els rocket landed, not in Kansas, but in the Soviet Union? That is the premise of this DC animated movie."
  },
  {
    "name": "Justice League Dark: Apokolips War",
    "year": 2020,
    "duration": "1h 30m",
    "genre": "Animation, Action, Adventure",
    "description": "A sequel to Justice League Dark (2017) involving Jack Kirbys New Gods."
  },
  {
    "name": "Pokémon: Mewtwo Strikes Back - Evolution",
    "year": 2019,
    "duration": "1h 38m",
    "genre": "Animation, Action, Family",
    "description": "After a scientific experiment leads to the creation of a clone of Mewtwo, he sets out to destroy the world. Ash and his friends then decide to thwart Mewtwos evil plans."
  },
  {
    "name": "Digimon Adventure: Last Evolution Kizuna",
    "year": 2020,
    "duration": "1h 34m",
    "genre": "Animation, Action, Adventure",
    "description": "The team discovers that when they grow up, their relationship with their Digimon will come closer to an end. They realize that the more they fight, the faster their bond breaks."
  },
  {
    "name": "Lupin III: The First",
    "year": 2019,
    "duration": "1h 33m",
    "genre": "Animation, Action, Adventure",
    "description": "Lupin III goes on a grand adventure to uncover the secrets of the Bresson Diary, which is tied to the legacy of his famous grandfather."
  },
  {
    "name": "The Croods: A New Age",
    "year": 2020,
    "duration": "1h 35m",
    "genre": "Animation, Adventure, Comedy",
    "description": "The prehistoric family the Croods are challenged by a rival family the Bettermans, who claim to be better and more evolved."
  },
  {
    "name": "Raya and the Last Dragon",
    "year": 2021,
    "duration": "1h 47m",
    "genre": "Animation, Action, Adventure",
    "description": "In a realm known as Kumandra, a re-imagined Earth inhabited by an ancient civilization, a warrior named Raya is determined to find the last dragon."
  }
]